src/Tasks/инкЗадачаПользователя/инкЗадачаПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>инкЗадачаПользователя</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляДоски</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оплачена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьДиалогиВвидеДерева</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрикрепленныеФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.инкПриоритетЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетИНомерЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.инкПроектыКЗадачам</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаПользователяИерархия</name>
    <type>
      <types>CatalogRef.инкЗадачаПользователяИерархия</types>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаДиалогов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.инкСтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасыПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧасыФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДиалогиКЗадачеТаблицаУдалить</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДСообщения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РассылкаВыполнена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеДиалога</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеЗадачи</name>
    <attributes>
      <name>СвязаннаяЗадача</name>
      <type>
        <types>TaskRef.инкЗадачаПользователя</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Task>

src/InformationRegisters/инкИсполнительПоПроекту/инкИсполнительПоПроекту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>инкИсполнительПоПроекту</name>
  <resources>
    <name>ПользовательУдалить</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.инкПроектыКЗадачам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/инкСтатусыЗадач/инкСтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкСтатусыЗадач</name>
  <enumValues>
    <name>БыстраяЗаметка</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>Пауза</name>
  </enumValues>
  <enumValues>
    <name>Тестирование</name>
  </enumValues>
</mdclass:Enum>

src/Tasks/инкЗадачаПользователя/Forms/ФормаСписка18/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)        
	
	ПользовательСсылка 	= Пользователи.ТекущийПользователь(); 
	ПроектСсылка 		= ПолучитьПроектПоУмолчанию(ПользовательСсылка);   
	
	Проекты.Очистить();	
	Проекты.Добавить(ПроектСсылка);
	
	ДобавитьИсполнителейПоПроектам(ПользовательСсылка,Проекты.ВыгрузитьЗначения());
	
	УстановитьВидимостьКолонокКАНБАН(ПользовательСсылка);
	
КонецПроцедуры   

&НаСервере
Процедура ДобавитьИсполнителейПоПроектам(ПользовательСсылка,ПроектыМассив)
	
	Исполнители.Очистить();
	Исполнители.Добавить(ПользовательСсылка);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	инкИсполнительПоПроекту.Проект КАК Проект,
		|	инкИсполнительПоПроекту.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.инкИсполнительПоПроекту КАК инкИсполнительПоПроекту
		|ГДЕ
		|	инкИсполнительПоПроекту.Проект В(&ПроектыМассив)
		|	И инкИсполнительПоПроекту.Пользователь <> &ТекущийПользователь";
	
	Запрос.УстановитьПараметр("ПроектыМассив", ПроектыМассив);
	Запрос.УстановитьПараметр("ТекущийПользователь", ПользовательСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 		
		Исполнители.Добавить(ВыборкаДетальныеЗаписи.Пользователь);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКолонокКАНБАН(ПользовательСсылка)

	ВидимостьКолонокКАНБАНСтруктура = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ВидимостьКолонокКАНБАНСтруктура",ПользовательСсылка.Наименование);
	
	Если ЗначениеЗаполнено(ВидимостьКолонокКАНБАНСтруктура) Тогда
		
		мВидимостьВРаботе = ВидимостьКолонокКАНБАНСтруктура.мВидимостьВРаботе;    
		мВидимостьЗавершено = ВидимостьКолонокКАНБАНСтруктура.мВидимостьЗавершено;
		мВидимостьКВыполнениюПауза = ВидимостьКолонокКАНБАНСтруктура.мВидимостьКВыполнениюПауза;
		мВидимостьСписокБыстрыеЗаметки = ВидимостьКолонокКАНБАНСтруктура.мВидимостьСписокБыстрыеЗаметки;
		мВидимостьТестирование = ВидимостьКолонокКАНБАНСтруктура.мВидимостьТестирование;
		
	Иначе

		мВидимостьСписокБыстрыеЗаметки = Ложь;
		мВидимостьВРаботе = Истина;    
		мВидимостьЗавершено = Истина;
		мВидимостьКВыполнениюПауза = Истина;
		мВидимостьТестирование = Истина;
		
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	ПользовательСсылка 	= Пользователи.ТекущийПользователь(); 
	
	ВидимостьКолонокКАНБАНСтруктура = Новый Структура;
	ВидимостьКолонокКАНБАНСтруктура.Вставить("мВидимостьВРаботе",мВидимостьВРаботе);    
	ВидимостьКолонокКАНБАНСтруктура.Вставить("мВидимостьЗавершено",мВидимостьЗавершено);
	ВидимостьКолонокКАНБАНСтруктура.Вставить("мВидимостьКВыполнениюПауза",мВидимостьКВыполнениюПауза);
	ВидимостьКолонокКАНБАНСтруктура.Вставить("мВидимостьСписокБыстрыеЗаметки",мВидимостьСписокБыстрыеЗаметки);
	ВидимостьКолонокКАНБАНСтруктура.Вставить("мВидимостьТестирование",мВидимостьТестирование);
		
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ВидимостьКолонокКАНБАНСтруктура",ПользовательСсылка.Наименование,ВидимостьКолонокКАНБАНСтруктура);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		ПриЗакрытииНаСервере();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПроектПоУмолчанию(ПользовательСсылка)
	
	ПроектСсылка = ПользовательСсылка.инкПроектПоУмолчанию;
	Если НЕ ЗначениеЗаполнено(ПроектСсылка) Тогда
		ПроектСсылка = Справочники.инкПроектыКЗадачам.ПолучитьПервыйПроект();	
	КонецЕсли;
	
	Возврат ПроектСсылка;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьОтборВСписках(); 
	УстановитьВидимостьКолонокКАНБАННаФорме();

КонецПроцедуры   

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	УстановитьОтборВСписках();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКВыполнениюПаузаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ОбновитьСтатусЗадачНаКлиенте("Пауза",ПараметрыПеретаскивания.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВРаботеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ОбновитьСтатусЗадачНаКлиенте("ВРаботе",ПараметрыПеретаскивания.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТестированиеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ОбновитьСтатусЗадачНаКлиенте("Тестирование",ПараметрыПеретаскивания.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗавершеноПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ОбновитьСтатусЗадачНаКлиенте("Завершено",ПараметрыПеретаскивания.Значение);
	
КонецПроцедуры                  

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	
	УстановитьОтборВСписках();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКВыполнениюПаузаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ОткрытьЗадачуПользователя(Элемент.ТекущаяСтрока,СтандартнаяОбработка);
	
КонецПроцедуры   

&НаКлиенте
Процедура СписокВРаботеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ОткрытьЗадачуПользователя(Элемент.ТекущаяСтрока,СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТестированиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ОткрытьЗадачуПользователя(Элемент.ТекущаяСтрока,СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗавершеноВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ОткрытьЗадачуПользователя(Элемент.ТекущаяСтрока,СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачу(Команда)

	ПараметрыФормы = ПолучитьСтруктуруЗаполненияЗадачи();
	ОткрытьФорму("Задача.инкЗадачаПользователя.Форма.ФормаЗадачи",ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры  

&НаКлиенте
Процедура СброситьНастройкиФормы(Команда)
	
	СброситьНастройкиФормыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СброситьНастройкиФормыНаСервере()
	
	//ХранилищеСистемныхНастроек.Удалить("Обработка.инкДоскаЗадачПользователей.Форма.Форма/НастройкиФормы",, ИмяПользователя());
	
КонецПроцедуры 	

&НаКлиенте
Процедура ОбновитьФорму(Команда)
	ОповеститьОбИзменении(Тип("ЗадачаСсылка.инкЗадачаПользователя"));
КонецПроцедуры

&НаКлиенте
Процедура СписокВсехЗадач(Команда)
	
	ОткрытьФорму("Справочник.инкЗадачаПользователяИерархия.Форма.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура БыстраяЗаметка(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.Найти("ГруппаБыстрыеЗаметки");	
	ПараметрыФормы = ПолучитьСтруктуруЗаполненияЗадачи();
	ОткрытьФорму("Задача.инкЗадачаПользователя.Форма.ФормаБыстраяЗаметка",ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры   

&НаКлиенте
Процедура СписокБыстрыеЗаметкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;                                          
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ",ВыбраннаяСтрока);
	
	ОткрытьФорму("Задача.инкЗадачаПользователя.Форма.ФормаБыстраяЗаметка",ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОплатаПоЗадачам(Команда)
	
	ОткрытьФорму("Отчет.инкОплатаПоЗадачам.Форма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьКолонокКАНБАННаФорме()

	Элементы.ГруппаБыстрыеЗаметки.Видимость = мВидимостьСписокБыстрыеЗаметки;
	Элементы.ГруппаКВыполнениюПауза.Видимость = мВидимостьКВыполнениюПауза;
	Элементы.ГруппаВРаботе.Видимость = мВидимостьВРаботе;
	Элементы.ГруппаТестирование.Видимость = мВидимостьТестирование;
	Элементы.ГруппаЗавершено.Видимость = мВидимостьЗавершено;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруЗаполненияЗадачи()

	СтруктураЗаполненияЗадачи = Новый Структура;   
	
	Если Проекты.Количество() = 1 Тогда
		СтруктураЗаполненияЗадачи.Вставить("Проект",Проекты[0].Значение);
	КонецЕсли;
	Если Исполнители.Количество() = 1 Тогда
		СтруктураЗаполненияЗадачи.Вставить("Исполнитель",Исполнители[0].Значение);
	КонецЕсли;                   
	
	Возврат СтруктураЗаполненияЗадачи;

КонецФункции

&НаКлиенте
Процедура УстановитьОтборВСписках()

	УстановитьОтоборПоПроектуВСпике("СписокКВыполнениюПауза",Проекты);
	УстановитьОтоборПоПроектуВСпике("СписокВРаботе",Проекты);
	УстановитьОтоборПоПроектуВСпике("СписокТестирование",Проекты);
	УстановитьОтоборПоПроектуВСпике("СписокЗавершено",Проекты);
	//
	УстановитьОтоборПоИсполнителюВСпике("СписокКВыполнениюПауза",Исполнители);
	УстановитьОтоборПоИсполнителюВСпике("СписокВРаботе",Исполнители);
	УстановитьОтоборПоИсполнителюВСпике("СписокТестирование",Исполнители);
	УстановитьОтоборПоИсполнителюВСпике("СписокЗавершено",Исполнители);
	//          

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтоборПоПроектуВСпике(ИмяСписка,ПроектСписок)
	
	ПользовательскийОтбор = ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных("Проект");
	
	ЭлементОтбораПользовательский = Неопределено;
	Для каждого ЭлементОтбора Из ПользовательскийОтбор.Элементы Цикл
		
		Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			ЭлементОтбораПользовательский = ЭлементОтбора; 		
		КонецЕсли;
		
	КонецЦикла;                              
	
	Если ЭлементОтбораПользовательский = Неопределено Тогда
		ЭлементОтбораПользовательский =  ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораПользовательский.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор();
	
	КонецЕсли;
	
	ЭлементОтбораПользовательский.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбораПользовательский.ЛевоеЗначение = ПолеКомпоновки;
	ЭлементОтбораПользовательский.ПравоеЗначение = ПроектСписок;
	ЭлементОтбораПользовательский.Использование = ЗначениеЗаполнено(ПроектСписок);                            
	ЭлементОтбораПользовательский.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтоборПоИсполнителюВСпике(ИмяСписка,ИсполнительСписок)
	
	ПользовательскийОтбор = ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭтотОбъект[ИмяСписка].КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных("Исполнитель");
	
	ЭлементОтбораПользовательский = Неопределено;
	Для каждого ЭлементОтбора Из ПользовательскийОтбор.Элементы Цикл
		
		Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			ЭлементОтбораПользовательский = ЭлементОтбора; 		
		КонецЕсли;
		
	КонецЦикла;                              
	
	Если ЭлементОтбораПользовательский = Неопределено Тогда
		ЭлементОтбораПользовательский =  ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораПользовательский.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор();
	
	КонецЕсли;
	
	ЭлементОтбораПользовательский.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбораПользовательский.ЛевоеЗначение = ПолеКомпоновки;
	ЭлементОтбораПользовательский.ПравоеЗначение = ИсполнительСписок;
	ЭлементОтбораПользовательский.Использование = ЗначениеЗаполнено(ИсполнительСписок);                            
	ЭлементОтбораПользовательский.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусЗадачНаКлиенте(СтатусСтрока,МассивЗадач)

	ОбновитьСтатусЗадачНаСервере(СтатусСтрока,МассивЗадач);
	ОповеститьОбИзменении(Тип("ЗадачаСсылка.инкЗадачаПользователя"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьСтатусЗадачНаСервере(СтатусСтрока,МассивЗадач)
	
	Если ТипЗнч(МассивЗадач) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;  
	
	Для каждого ЗадачаСсылка Из МассивЗадач Цикл
		
		УстанановитьСтатус = Перечисления.инкСтатусыЗадач[СтатусСтрока];
		Если ЗадачаСсылка.Статус = УстанановитьСтатус Тогда
			Прервать;
		КонецЕсли;
		
		Попытка
			ЗадачаОбъект = ЗадачаСсылка.ПолучитьОбъект();
			ЗадачаОбъект.Статус = УстанановитьСтатус;
			ЗадачаОбъект.Выполнена = (ЗадачаОбъект.Статус = Перечисления.инкСтатусыЗадач.Завершено);
			ЗадачаОбъект.Записать();
		Исключение
		    инкОбщийКлиентСервер.СообщитьПользователю("Ошибка при записи задачи. Описание: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗадачуПользователя(ЗадачаСсылка,СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Ключ", ЗадачаСсылка);
    ОткрытьФорму("Задача.инкЗадачаПользователя.Форма.ФормаЗадачи", ПараметрыФормы,,Новый УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьПриИзменении(Элемент)
	
	УстановитьВидимостьКолонокКАНБАННаФорме();
	
КонецПроцедуры

#КонецОбласти
